cases/TFM-steady/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type               cyclic;
    }

    bottom.snow
    {
        type               calculated;
        value              $internalField;
    }

    sides
    {
        type               empty;
    }

    top
    {
        type               calculated;
        value              $internalField;
    }

    outlet
    {
        type               cyclic;
    }
}


// ************************************************************************* //
