cases/TFM-steady/system/codeDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          codeDict;
}


erosionFlux
{
    // code
    // \left.\left(\frac{\partial \phi}{\partial z}\right)\right|_{\text {surface}} 
    // = -\frac{1}{D_{t}} \frac{\left|M_{\text {ero }}\right|}{A_{\mathrm{hol}}}
    code
    #{
        // 获得当前Patch的ID
        // label patchIndex = patch().index();
        const scalar lowerLimit = 0.;

        fvPatchField<scalar> Q
        (
            patch().lookupPatchField<volScalarField, scalar>("driftDensity")
        );
        
        // 湍流黏度
        const fvPatchField<scalar>& nut
        (
            patch().lookupPatchField<volScalarField, scalar>("nut")
        );

        // 获得与边界面相邻网格格心处的雪漂浓度
        tmp<scalarField> &QInt = patch().lookupPatchField<volScalarField, scalar>("driftDensity").patchInternalField();

        forAll(Q, i)
        {
            Q[i] = QInt()[i]
        }

        operator == (Q);

        //Info << "done." <<endl;
    #};
        
    // Optional
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    // Optional
    codeOptions 
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude 
    #};
}

erosionFlux1
{
    // code
    // \left.\left(\frac{\partial \phi}{\partial z}\right)\right|_{\text {surface}} 
    // = -\frac{1}{D_{t}} \frac{\left|M_{\text {ero }}\right|}{A_{\mathrm{hol}}}
    code
    #{
        // 获得当前Patch的ID
        label patchIndex = patch().index();

        const scalar lowerLimit = 0.;

        fvPatchField<scalar> Q
        (
            patch().lookupPatchField<volScalarField, scalar>("driftDensity")
        );
        
        // 湍流黏度
        const fvPatchField<scalar>& nut
        (
            patch().lookupPatchField<volScalarField, scalar>("nut")
        );
        
        //Info << "Patch ID: " << patchIndex << endl;
        //Info << "Adopt mass exchange boundary condition on patch \"" << patch().name() << "\"...";

        // 获得全局的质量交换场
        //const surfaceScalarField & MGlobal = this->db().objectRegistry::lookupObject<surfaceScalarField>("M");
        
        // 获得当前Patch的质量交换场
        //const scalarField & Mp = MGlobal.boundaryField()[patchIndex];

        const incompressible::turbulenceModel& turbulence = this->db().lookupObject<incompressible::turbulenceModel>
        (
            IOobject::groupName
            (
                incompressible::turbulenceModel::propertiesName,
                internalField().group()
            )
        );

        const tmp<volSymmTensorField> Reff = turbulence.devReff();
        const symmTensorField& Reffp = Reff().boundaryField()[patchIndex];

        // 获得与边界面相邻网格格心处的雪漂浓度
        const tmp<scalarField> &QInt = patch().lookupPatchField<volScalarField, scalar>("driftDensity").patchInternalField();

        vector zNormal = vector(0, 0, -1);

        forAll(Q, i)
        {
            // 网格面在z方向的投影面积
            scalar zNormalArea = patch().Sf()[i] & zNormal;

            vector Sfp = patch().Sf()[i];         // 面积矢量
            scalar magSfp = patch().magSf()[i];   // 面积矢量模长

            vector ssp = (-Sfp/magSfp) & Reffp[i];

            scalar uShear = sqrt(mag(ssp));
            //Info << uStar << endl;
            // z方向的浓度梯度

            scalar Uthreshold = 0.15;
            scalar zGrad;
            if (uShear > Uthreshold || fabs(patch().Cf()[i][2] - lowerLimit) > 1e-3 ) // 侵蚀
            {
                //Mp[i] = -ca * rhoSnow * UShear[i] * (1.-sqr(Uthreshold)/sqr(UShear[i])) *zArea;
                zGrad = -7e-4 * 150 * (sqr(uShear) - sqr(Uthreshold)) / (nut[i] + 1e-16);
            }
            else // 沉积
            {
                zGrad = 0.;  //发生沉积时梯度为0
            }

            Q[i] = QInt()[i] - zGrad / patch().deltaCoeffs()[i];


            /*
            if (Q[i] < 1e-4)
            {
                Info << "Q = "<< Q[i] << ", " << "QInt = " << QInt()[i] << endl;
                Info << "Grad = "<< zGrad << endl;
            }
            */
        }

        operator == (Q);

        //Info << "done." <<endl;
    #};
        
    // Optional
    codeInclude
    #{
        #include "fvCFD.H"
        #include "turbulentTransportModel.H"
    #};

    // Optional
    codeOptions 
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude \
        -I$(LIB_SRC)/TurbulenceModels/turbulenceModels/lnInclude \
        -I$(LIB_SRC)/TurbulenceModels/incompressible/lnInclude \
        -I$(LIB_SRC)/transportModels \
        -I$(LIB_SRC)/transportModels/incompressible/singlePhaseTransportModel
    #};
}

erosionDeposition
{
    code
    #{
        
        label patchIndex = patch().index();
        const volScalarField& deltaH = this->db().objectRegistry::lookupObject<volScalarField>("deltaH");

        primitivePatchInterpolation facePointInterp(deltaH.mesh().boundaryMesh()[patchIndex]);   //初始化插值类

        const scalarField& deltaHp = deltaH.boundaryField()[patchIndex];
        auto deltaHpp = facePointInterp.faceToPointInterpolate(deltaHp);                      //面心向节点插值
        Info << "Successfully interpolate "<< deltaHpp().size() << " points." << endl;
        Info << "Local points number = " << patch().localPoints().size() << endl;
        pointField pVec(deltaHpp().size());

        const scalar lowerLimit = 0.;

        forAll(pVec, i)
        {
            pVec[i][0] = 0;
            pVec[i][1] = 0;
            pVec[i][2] = deltaHpp()[i];

            if(patch().localPoints()[i][2] + pVec[i][2] * this->db().time().deltaTValue() < lowerLimit)
            {    
                pVec[i][2] = (lowerLimit - patch().localPoints()[i][2])/this->db().time().deltaTValue();
            }
        }

        (*this) == pVec;
    #};

    codeInclude
    #{
        #include "fvCFD.H"
        #include "primitivePatchInterpolation.H"
    #};

    codeOptions 
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude 
    #};
}

inletFlux
{
    code
    #{
        scalar rhoSnow = 350;
        
        fvPatchField<scalar> alpha
        (
            patch().lookupPatchField<volScalarField, scalar>("alpha.snow")
        );

        fvPatchField<vector> U
        (
            patch().lookupPatchField<volVectorField, vector>("U.snow")
        );

        forAll(alpha, i)
        {
            scalar z = patch().Cf()[i][2];
            alpha[i] = 0.1708 * pow(z, -0.6621);
            /*
            if (z < 0.1)
            {
                alpha[i] = 0.8;
            }
            */
            alpha[i] /= 86400 * 1000 / 100 / 100;
            alpha[i] /= U[i][0];
            alpha[i] /= rhoSnow;
        }

        operator == (alpha);
    #};
}