cases/TFM-steady/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
samples
{
type            sets;
libs            (sampling);
writeControl    writeTime;

interpolationScheme cellPoint;

setFormat raw;

sets
(
    xm10
    {
        type            face;
        axis            x;
        start           (0 5.5 0);
        end             (5 5.5 0);
    }
);

fields          (U alpha.snow);
}

// ************************************************************************* //
